# Pandas

## Pandas数据结构

In [5]:
import pandas as pd
import numpy as np

尽管pandas采用了很多NumPy的代码风格，但最大
的不同在于pandas是用来处理表格型或异质型数据的。
而NumPy则相反，它更适合处理同质型的数值类数组
数据。
两个常用的工具数据
结构：Series和DataFrame。

### Series

Series是一种一维的数组型对象，它包含了一个值
序列（与NumPy中的类型相似），并且包含了数据标
签，称为索引（index）。最简单的序列可以仅仅由一
个数组形成

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
# 通过values属性和index属性分别获得Series对象的值和索引
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
# 用标签标识每个数据
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a','e'])
print(obj2)

# 使用标签来索引
obj2['a']

d    4
b    7
a   -5
e    3
dtype: int64

-5

In [16]:
# 用布尔值数组过滤
obj2[obj2 > 0]

d    4
b    7
e    3
dtype: int64

In [17]:
# 与标量相乘
obj2 * 2

d     8
b    14
a   -10
e     6
dtype: int64

In [20]:
# 应用数学函数
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
e      20.085537
dtype: float64

另一个角度考虑Series，可以认为它是一个长度
固定且有序的字典，因为它将索引值和数据值按位置配
对。在你可能会使用字典的上下文中，也可以使用Series

In [22]:
"b" in obj2

True

In [23]:
"e" in obj2

True

In [26]:
# 已经有数据包含在Python字典中，可使用字典生成Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 1600}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon     1600
dtype: int64

In [27]:
# index 传参 从而使生成的Series的索引顺序符合你的预期
new_index = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = new_index)
obj4

California        NaN
Ohio          35000.0
Oregon         1600.0
Texas         71000.0
dtype: float64

In [28]:
# pandas中使用isnull和notnull函数来检查缺失数据
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [30]:
# isnull和notnull也是Series的实例方法
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [31]:
# 数据对齐特性与数据库的join操作是非常相似
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon          3200.0
Texas         142000.0
dtype: float64

In [35]:
# Series对象自身和其索引都有name属性，
# 这个特性与pandas其他重要功能集成在一起
obj4.name = 'population'
obj4.index.name = 'state'

In [36]:
obj4

state
California        NaN
Ohio          35000.0
Oregon         1600.0
Texas         71000.0
Name: population, dtype: float64

In [40]:
# Series的索引可以通过按位置赋值的方式进行改变
obj
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

DataFrame:
矩阵的数据表[已排序的列集合数值、字符串、布尔值]
DataFrame既有行索引也有列索引，可以视为一个共享相同索引的Series的字典。
DataFrame是二维的，可利用分层索引在DataFrame中展现更高维度数据

构建DataFrame:包含等长度列表或NumPy数组的字典

In [6]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada','Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
# 指定列的顺序 DataFrame的列将会按照指定顺序排列
pd.DataFrame(data, columns=['year','state','pop','debt'])
# 传的列不包含在字典中，将会在结果中出现缺失值

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [11]:
# 指定index
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'],index=['one','two','five','three','four','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
five   2002    Ohio  3.6  NaN
three  2001  Nevada  2.4  NaN
four   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [18]:
frame2['year']

one      2000
two      2001
five     2002
three    2001
four     2002
six      2003
Name: year, dtype: int64

In [21]:
frame2['pop']

one      1.5
two      1.7
five     3.6
three    2.4
four     2.9
six      3.2
Name: pop, dtype: float64

In [22]:
# 行也可以通过位置或特殊属性loc进行选取
frame2.loc['three']

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: three, dtype: object

In [23]:
# 列的引用是可以修改的。例如，空的'debt'列可以赋值为标量值或值数组
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
five   2002    Ohio  3.6  16.5
three  2001  Nevada  2.4  16.5
four   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [25]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
five   2002    Ohio  3.6   2.0
three  2001  Nevada  2.4   3.0
four   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [26]:
frame2['debt'] = [1,2,3,4,5,2]
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     1
two    2001    Ohio  1.7     2
five   2002    Ohio  3.6     3
three  2001  Nevada  2.4     4
four   2002  Nevada  2.9     5
six    2003  Nevada  3.2     2

In [30]:
# 利用series传入一列数据到dataframe
val = pd.Series(np.arange(6,12), index =['one','two','five','three','four','six'])
val

one       6
two       7
five      8
three     9
four     10
six      11
dtype: int32

In [31]:
frame2['insert_val'] = val
frame2

       year   state  pop  debt  insert_val
one    2000    Ohio  1.5     1           6
two    2001    Ohio  1.7     2           7
five   2002    Ohio  3.6     3           8
three  2001  Nevada  2.4     4           9
four   2002  Nevada  2.9     5          10
six    2003  Nevada  3.2     2          11

In [34]:
# 删除列
del frame2['debt']
frame2

KeyError: 'debt'

In [38]:
# 另一种常用的数据形式是包含字典的嵌套字典

# pandas会将字典的键作为列，将内部字典的键作为行索引
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)

In [39]:
# Dataframe行列转置
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [40]:
# 含Series的字典也可用于构造DataFrame
pdata = {'Ohio': frame3['Ohio'][:-1], 
        'Nevada': frame3['Nevada'][:2]}

# 可以将frame3['Ohio']看做一个Series，然后字典键看做列。
# frame3['Ohio'][:-1] 等同于一个字典，内部字典的键作为行索引
# 简单看来，字典套字典
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [45]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [48]:
# DataFrame中的数据以二维ndarray的形式返回
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [49]:
# 如果DataFrame的列是不同的dtypes
# 则values的dtype会自动选择适合所有列的类型
frame2.values

array([[2000, 'Ohio', 1.5, 6],
       [2001, 'Ohio', 1.7, 7],
       [2002, 'Ohio', 3.6, 8],
       [2001, 'Nevada', 2.4, 9],
       [2002, 'Nevada', 2.9, 10],
       [2003, 'Nevada', 3.2, 11]], dtype=object)

### 索引对象

pandas中的索引对象是用于存储轴标签和其他元数
据的（例如轴名称或标签）。

在构造Series或DataFrame时，你所使用的任意数组或标签序列都可以在内部转换为索引对象

In [54]:
obj = pd.DataFrame(range(3), index=['a','b','c'])
index = obj.index
print(index)
index[1:]

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

In [57]:
# 索引对象是不可变的，因此用户是无法修改索引对象的
index[1]='d'

TypeError: Index does not support mutable operations

In [64]:
# 不变性使得在多种数据结构中分享索引对象更为安全
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2
obj2.index is labels

True

In [68]:
# 除了类似数组，索引对象也像一个固定大小的集合
frame3
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [70]:
# 与Python集合不同，pandas索引对象可以包含重复标签
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## 基本功能

### 重建索引

In [118]:
# reindex是pandas对象的重要方法，
# 该方法用于创建一个符合新索引的新对象。
# Series调用reindex方法时，会将数据按照新的索引进行排列，
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'a','b','c'])
obj

obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a    7.2
b   -5.3
c    3.6
d    4.5
e    NaN
dtype: float64

In [119]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3
# 在重建索引时可能会需要进行插值或填值,ffill方法会将值前向填充
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [120]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),
index = ['z','x','y'],columns=['a','b','c'])
frame

   a  b  c
z  0  1  2
x  3  4  5
y  6  7  8

In [123]:
# 在DataFrame中，reindex可以改变行索引、列索引，也可以同时改变二者。
# 当仅传入一个序列时，结果中的行会重建索引。
# reindex只是对排序进行调整，如果出现了新的indexname则会多创建一列（行）
frame2 = frame.reindex(columns=['c','a','b'])
frame2

   c  a  b
z  2  0  1
x  5  3  4
y  8  6  7

In [127]:
# 以使用loc进行更为简洁的标签索引

# 列可以使用columns关键字重建索引
states = ['b','a','california']
frame = frame.reindex(columns = states)

In [128]:
# loc[[行的Index数组], 列的index_name]
frame.loc[['y','z','x'], states]

   b  a  california
y  7  6         NaN
z  1  0         NaN
x  4  3         NaN

### 轴向上删除条目

如果你已经拥有索引数组或不含条目的列表，在轴
向上删除一个或更多的条目就非常容易，但这样需要一
些数据操作和集合逻辑，drop方法会返回一个含有指示
值或轴向上删除值的新对象：

In [134]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [133]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [135]:
obj.drop(['d', 'c']) # 临时删除

a    0.0
b    1.0
e    4.0
dtype: float64

In [144]:
# 在DataFrame中，索引值可以从轴向上删除。
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

data.drop('two', axis=1) # 未加inplace 不直接操作原对象 

# data.drop('one', axis = 1, inplace=True)
# inplace 直接操作原对象

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### 索引、选择与过滤

Series的索引（obj[...]）与NumPy数组索引的功能类似，只不过Series的索引值可以不仅仅是整数。

In [145]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [149]:
print(obj['b'],"\n")
print(obj[1],"\n")
print(obj[['b', 'a', 'd']], "\n")

1.0

1.0

b    1.0
a    0.0
d    3.0
dtype: float64

In [151]:
# 普通的Python切片中是不包含尾部的，Series的切片与之不同
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [152]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [154]:
# 使用单个值或序列，可以从DataFrame中索引出一个或多个列
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [156]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [157]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [158]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [159]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [162]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

使用loc和iloc选择数据